# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [24]:
#Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [19]:
#Your code here
cur.execute("""select * from employees join offices using(officeCode) 
where city = 'Boston';""")
#cur.fetchmany(2)

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [18]:
#Your code here
cur.execute("""SELECT city, count(lastname) FROM employees join offices 
            using(officeCode) GROUP BY 1 ;""")
cur.fetchall()

[('Boston', 2),
 ('London', 2),
 ('NYC', 2),
 ('Paris', 5),
 ('San Francisco', 6),
 ('Sydney', 4),
 ('Tokyo', 2)]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [28]:
# Your code here
cur.execute("""SELECT lastname, productName 
FROM employees e JOIN customers c 
ON e.employeeNumber = c.salesRepEmployeeNumber
JOIN orders o using(customernumber)
JOIN orderdetails od using(ordernumber)
JOIN products p using (productCode)""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head(10)

   lastName                                  productName
0  Jennings                               1958 Setra Bus
1  Jennings                       1940 Ford Pickup Truck
2  Jennings                      1939 Cadillac Limousine
3  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings                            1968 Ford Mustang
5  Jennings                           1968 Dodge Charger
6  Jennings                      1970 Plymouth Hemi Cuda
7  Jennings                           1969 Dodge Charger
8  Jennings                  1948 Porsche 356-A Roadster
9  Jennings                         1969 Dodge Super Bee

## Level Up: Display the Number of Products each employee has sold

In [29]:
#Your code here
df.groupby("productName").count()

                                             lastName
productName
18th Century Vintage Horse Carriage                28
18th century schooner                              27
1900s Vintage Bi-Plane                             28
1900s Vintage Tri-Plane                            28
1903 Ford Model A                                  27
1904 Buick Runabout                                27
1911 Ford Town Car                                 25
1912 Ford Model T Delivery Wagon                   27
1913 Ford Model T Speedster                        28
1917 Grand Touring Sedan                           25
1917 Maxwell Touring Car                           28
1926 Ford Fire Engine                              28
1928 British Royal Navy Airplane                   28
1928 Ford Phaeton Deluxe                           28
1928 Mercedes-Benz SSK                             28
1930 Buick Marquette Phaeton                       28
1932 Alfa Romeo 8C2300 Spider Sport                25
1932 Model A Ford J-Coupe                          28
1934 Ford V8 Coupe                                 28
1936 Chrysler Airflow                              28
1936 Harley Davidson El Knucklehead                28
1936 Mercedes Benz 500k Roadster                   25
1936 Mercedes-Benz 500K Special Roadster           28
1937 Horch 930V Limousine                          28
1937 Lincoln Berline                               28
1938 Cadillac V-16 Presidential Limousine          28
1939 Cadillac Limousine                            28
1939 Chevrolet Deluxe Coupe                        28
1940 Ford Delivery Sedan                           28
1940 Ford Pickup Truck                             28
...                                               ...
1995 Honda Civic                                   27
1996 Moto Guzzi 1100i                              28
1996 Peterbilt 379 Stake Bed with Outrigger        28
1997 BMW F650 ST                                   28
1997 BMW R 1100 S                                  28
1998 Chrysler Plymouth Prowler                     28
1999 Indy 500 Monte Carlo SS                       25
1999 Yamaha Speed Boat                             28
2001 Ferrari Enzo                                  27
2002 Chevy Corvette                                25
2002 Suzuki XREO                                   28
2002 Yamaha YZR M1                                 27
2003 Harley-Davidson Eagle Drag Bike               28
ATA: B757-300                                      28
America West Airlines B757-200                     28
American Airlines: B767-300                        28
American Airlines: MD-11S                          28
Boeing X-32A JSF                                   28
Collectable Wooden Train                           27
Corsair F4U ( Bird Cage)                           28
Diamond T620 Semi-Skirted Tanker                   28
F/A 18 Hornet 1/72                                 28
HMS Bounty                                         28
P-51-D Mustang                                     28
Pont Yacht                                         27
The Mayflower                                      27
The Queen Mary                                     27
The Schooner Bluenose                              27
The Titanic                                        27
The USS Constitution Ship                          27

[109 rows x 1 columns]

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!